In [8]:
import pandas as pd

In [9]:
data = {"Name" : ["Ravi","Anu","Kiran","Meena"],
        "Age" : [22,25,23,21],
        "Marks" : [78,85,90,66]}
df = pd.DataFrame(data)
print(df)

    Name  Age  Marks
0   Ravi   22     78
1    Anu   25     85
2  Kiran   23     90
3  Meena   21     66

In [10]:
#Column Selection
print(df["Name"])
print(df[["Name","Marks"]])

0     Ravi
1      Anu
2    Kiran
3    Meena
Name: Name, dtype: object
    Name  Marks
0   Ravi     78
1    Anu     85
2  Kiran     90
3  Meena     66

In [11]:
#Row Selection
print(df.loc[0])
print(df.iloc[1:3,0])    #select row at integer position 1 and 2and the column position 0
print(df.iloc[1])

Name     Ravi
Age        22
Marks      78
Name: 0, dtype: object
1      Anu
2    Kiran
Name: Name, dtype: object
Name     Anu
Age       25
Marks     85
Name: 1, dtype: object

In [12]:
#Conditional Filtering
print(df[df["Marks"]>80])

    Name  Age  Marks
1    Anu   25     85
2  Kiran   23     90

In [18]:
#Sorting
print(df.sort_values(by="Marks",ascending=False))

    Name  Age  Marks
2  Kiran   23     90
1    Anu   25     85
0   Ravi   22     78
3  Meena   21     66

In [27]:
#Practice Tasks
print(df["Age"])              #Selecting only Age row
print(df.loc[0:1])            #select first 2 rows
print(df[df["Marks"]<70])     #Filter the students marks lessthan 70
print(df.sort_values(by="Age"))  #Sort by age

0    22
1    25
2    23
3    21
Name: Age, dtype: int64
   Name  Age  Marks
0  Ravi   22     78
1   Anu   25     85
    Name  Age  Marks
3  Meena   21     66
    Name  Age  Marks
3  Meena   21     66
0   Ravi   22     78
2  Kiran   23     90
1    Anu   25     85

In [35]:
#Mini Task
data1 = { "Employee":["A","B","C","D"],
          "Salary" : [30000,45000,25000,50000],
          "Experience" : [1,2,3,4]}
a = pd.DataFrame(data1)
print(a)
print(a[a["Salary"]>40000])                                 #employees with salary >40000
print(a.sort_values(by = "Experience" , ascending = False)) #sort by experience
print(a[["Employee","Salary"]])                             #Select employee and experience

  Employee  Salary  Experience
0        A   30000           1
1        B   45000           2
2        C   25000           3
3        D   50000           4
  Employee  Salary  Experience
1        B   45000           2
3        D   50000           4
  Employee  Salary  Experience
3        D   50000           4
2        C   25000           3
1        B   45000           2
0        A   30000           1
  Employee  Salary
0        A   30000
1        B   45000
2        C   25000
3        D   50000